; harinote-ipl
; TAB=4

(불러오기 "레지스터.ㅁㄲ")
(불러오기 "공통.ㅁㄲ")

(정의 영상_유형 0육105)
; 0x100: 640 x 400 x 8bit
; 0x101: 640 x 480 x 8bit
; 0x103 :  800 x  600 x 8bit
; 0x105 : 1024 x  768 x 8bit
; 0x107 : 1280 x 1024 x 8bit

(정의 부트_포장 0x00280000)
(정의 원반_캐시 0x00100000)
(정의 원반_캐시0 0x00008000)

; BOOT INFO
(정의 실린더 0육0ff0)    ; CYLS
(정의 LED_상태 0육0ff1)   ; LEDS (또는 키보드_램프)
(정의 영상_모드 0육0ff2)   ; VMODE (색상 수 등)
(정의 화면_너비 0육0ff4)   ; SCRNX
(정의 화면_높이 0육0ff6)   ; SCRNY
(정의 비디오_램 0육0ff8)   ; VRAM

(정의 시작점 0육200)


(정의 헤더 `(
	,(이름표 '헤더) ; header
; Check VBE
	,@(이동_16톨_상수 셈 (2바이트 0육9000)) ; MOV 	AX, 0x9000 | B8 00 90
	,@(이동_레지_세그 (주소_레지 여분판 셈)) ; MOV 	ES, AX | 8E C0
	,@(이동_16톨_상수 도착 (2바이트 0)) ; MOV 	DI, 0 | BF 00 00
	,@(이동_16톨_상수 셈 (2바이트 0육4f00)) ; MOV 	AX, 0x4f00 | B8 00 4F
	,@(인터럽트 0육10) ; INT 	0x10 | CD 10
	,(뛰기_다름 '화면320) ; JNE 	scrn320 | 
; VBE version check
	,@(여분판_접두사
			(이동_16톨_레지 (주소_메모리_16 7 ㅁ+도착 0육04))) ; MOV 	AX, [ES:DI+4]
	,@(비교_16톨_레지_상수 셈 0육0200) ; CMP 	AX, 0x0200
	,(뛰기_다름 '화면320) ; JB  	scrn320
; get screen mode info
	,@(이동_16톨_상수 횟수 (2바이트 영상_유형)) ; MOV 	CX, VBEMODE
	,@(이동_16톨_상수 셈 (2바이트 0육4f01)) ; MOV 	AX, 0x4f01
	,@(인터럽트 0육10) ; INT 	0x10 | CD 10
	,@(비교_16톨_레지_상수 셈 0육004ㅂ) ; CMP 	AX, 0x004f
	,(뛰기_다름 '화면320) ; JNE 	scrn320
; check screen mode info
	,@(여분판_접두사 
		(비교_멤_8톨_상수 (주소_메모리_8 7 ㅁ+도착 0육19) 8)) ; CMP 	BYTE [ES:DI+0x19], 8
	,(뛰기_다름 '화면320) ; JNE		scrn320
	,@(여분판_접두사 
		(비교_멤_8톨_상수 (주소_메모리_8 7 ㅁ+도착 0육1ㄴ) 8)) ; CMP 	BYTE [ES:DI+0x1b], 4
	,(뛰기_다름 '화면320) ; JNE		scrn320
	,@(여분판_접두사 
		(이동_16톨_레지 (주소_메모리_8 셈 ㅁ+도착 0육00))) ; MOV 	AX, [ES:DI+0x00]
	,@(더하기_16톨_레지_상수 셈 0육0080) ; AND 	AX, 0x0080
	,(뛰기_동일 '화면320) ; JZ  	scrn320

; change screen mode
	,@(이동_16톨_상수 기준 (2바이트 (+ 영상_유형 0육4000))) ; MOV 	BX, VBEMODE+0x4000
	,@(이동_16톨_상수 셈 (2바이트 0육4f02)) ; MOV 	AX, 0x4f02
	,@(인터럽트 0육10) ; INT 	0x10 | CD 10
	,@(이동_멤_8톨_상수 영상_모드 8) ; MOV 	BYTE [VMODE], 8
	,@(여분판_접두사
		(이동_16톨_레지 (주소_메모리_8 0 ㅁ+도착 0육12))) ; MOV		AX, [ES:DI+0x12]
	,@(저장_멤_16톨_레지 화면_너비 셈) ; MOV 	[SCRNX], AX
	,@(여분판_접두사
		(이동_16톨_레지 (주소_메모리_8 0 ㅁ+도착 0육14))) ; MOV		AX, [ES:DI+0x14]
	,@(저장_멤_16톨_레지 화면_높이 셈) ; MOV 	[SCRNY], AX
	,@(32톨_접두사
		(여분판_접두사
			(이동_16톨_레지 (주소_메모리_8 셈 ㅁ+도착 0육28)))) ; MOV 	EAX, [ES:DI+0x28]
	,@(32톨_접두사
		(저장_멤_셈 비디오_램)) ; MOV 	[VRAM], EAX
	,(뛰기_이름표 '입력상태); JMP 	keystatus
))

(정의 화면320 `(
	,(이름표 '화면320) ; scrn320
	,@(이동_8톨_상수 하위8톨-셈 0육13) ; MOV		AL, 0x13
	,@(이동_8톨_상수 상위8톨-셈 0육00) ; MOV		AH, 0x00
	,@(인터럽트 0육10) ; INT		0x10 | CD 10
	,@(이동_멤_8톨_상수 영상_모드 8) ; MOV 	BYTE [VMODE], 8
	,@(이동_멤_16톨_상수 화면_너비 320) ; MOV		WORD [SCRNX], 320
	,@(이동_멤_16톨_상수 화면_높이 200) ; MOV		WORD [SCRNY], 200
	,@(이동_멤_32톨_상수 비디오_램 0육000ㄱ0000) ; MOV		DWORD [VRAM], 0x000a0000
))

(정의 입력상태 `(
	; keyboard led state
	,(이름표 '입력상태) ; keystatus
	,@(이동_8톨_상수 상위8톨-셈 0육02) ; MOV		AH, 0x02
	,@(인터럽트 0육16) ; INT		0x16 | CD 16
	,@(저장_멤_8톨_레지 LED_상태 하위8톨-셈) ; MOV 	[LEDS], AL

; PIC don't receive any interrupt
	,@(이동_8톨_상수 하위8톨-셈 0육ㅂㅂ); MOV		AL,	0xff
	,@(출력_상수_하위8톨-셈 0육21) ; OUT		0x21, AL
	,노옵 ; NOP
	,@(출력_상수_하위8톨-셈 0육ㄱ1) ; OUT		0xa1, AL

	,인터럽트_끄기 ; CLI | FA

; set A20GATE to allow the CPU to access more than 1MB of Memory
	,(호출_이름표 '키보드기다려) ; CALL	waitkbdout
	,@(이동_8톨_상수 하위8톨-셈 0육ㄹ1) ; MOV		AL,	0xd1
	,@(출력_상수_하위8톨-셈 0육64) ; OUT		0x64, AL
	,(호출_이름표 '키보드기다려) ; CALL	waitkbdout
	,@(이동_8톨_상수 하위8톨-셈 0육ㄹㅂ) ; MOV		AL, 0xdf
	,@(출력_상수_하위8톨-셈 0육60) ; OUT		0x60, AL
	,(호출_이름표 '키보드기다려) ; CALL	waitkbdout

	,@(불러_지디티_이름표 '지디티알0) ; LGDT	[GDTR0]
	,@(이동_레지_제어 셈 제어0) ; MOV		EAX, CR0
	,@(비트곱_32톨_셈_상수 0육7ㅂㅂㅂㅂㅂㅂㅂ) ; AND		EAX, 0x7fffffff
	,@(비트합_32톨_셈_상수 0육00000001) ; OR		EAX, 0x00000001
	,@(이동_제어_레지 제어0 셈) ; MOV		CR0, EAX
	,(뛰기_이름표 '파이프라인_플러시) ; JMP		pipelineflush
))

(정의 파이프라인_플러시 `(
	,(이름표 '파이프라인_플러시) ; pipelineflush
	,@(이동_16톨_상수 셈 (2바이트 (* 1 8))) ; MOV		AX, 1*8
	,@(이동_레지_세그 (주소_레지 자료판 셈)) ; MOV		DS, AX
	,@(이동_레지_세그 (주소_레지 여분판 셈)) ; MOV		ES, AX
	,@(이동_레지_세그 (주소_레지 추가판1 셈)) ; MOV		FS, AX
	,@(이동_레지_세그 (주소_레지 추가판2 셈)) ; MOV 	GS, AX
	,@(이동_레지_세그 (주소_레지 쌓음판 셈)) ; MOV		SS, AX

	; send bootpack
	,@(32톨_접두사
		(이동_32톨_이름표 ㅁ+출처 (리스트 (이름표_주소 '부트팩)))) ; MOV		ESI, bootpack
	,@(32톨_접두사
		(이동_32톨_상수 ㅁ+도착 부트_포장)) ; MOV		EDI, BOTPAK
	,@(32톨_접두사
		(이동_32톨_상수 횟수 (/ (* 512 1024) 4))) ; MOV		ECX, 512*1024/4
	,(호출_이름표 '멤_복사) ; CALL	memcpy

	; send disk data
	; boot sector
	,@(32톨_접두사
		(이동_32톨_상수 ㅁ+출처 0육7ㄷ00)) ; MOV		ESI, 0x7c00
	,@(32톨_접두사
		(이동_32톨_상수 ㅁ+도착 원반_캐시)) ; MOV		EDI, DSKCAC
	,@(32톨_접두사
		(이동_32톨_상수 횟수 (/ 512 4))) ; MOV		ECX, 512/4
	,(호출_이름표 '멤_복사) ; CALL	memcpy
	; remain
	,@(32톨_접두사
		(이동_32톨_상수 ㅁ+출처 (+ 원반_캐시0 512))) ; MOV		ESI, DSKCAC0+512
	,@(32톨_접두사
		(이동_32톨_상수 ㅁ+도착 (+ 원반_캐시 512))) ; MOV		EDI, DSKCAC+512
	,@(32톨_접두사
		(이동_32톨_상수 횟수 0)) ; MOV		ECX, 0
	,@(이동_8톨_레지_멤 하위8톨-횟수 실린더) ; MOV		CL, BYTE [CYLS]
	,@(32톨_접두사
		(곱하기_32톨_상수 횟수 (/ (* (* 512 18) 2) 4))) ; IMUL	ECX, 512*18*2/4
	,@(32톨_접두사
		(빼기_32톨_상수 횟수 (/ 512 4))) ; SUB		ECX, 512/4
	,(호출_이름표 '멤_복사) ; CALL	memcpy

	; bootpack
	,@(32톨_접두사
		(이동_32톨_상수 ㅁ+기준 부트_포장)) ; MOV		EBX, BOTPAK
	,@(32톨_접두사
      (주소_접두사
        (이동_32톨_레지_멤_8 횟수 자료 16))) ; MOV		ECX, [EBX+16]
	,@(32톨_접두사
		(더하기_32톨_레지_상수 횟수 3)) ; ADD		ECX, 3
	,@(32톨_접두사
		(비트이동_오른쪽 횟수 2)) ; SHR		ECX, 2
	,(뛰기_동일 '생략) ; JZ		skip
	,@(32톨_접두사
      (주소_접두사
        (이동_32톨_레지_멤_8 출처 자료 20))) ; MOV		ESI, [EBX+20]
	,@(32톨_접두사
		(더하기_16톨_레지_레지 ㅁ+출처 자료)) ; ADD		ESI, EBX
	,@(32톨_접두사
      (주소_접두사
        (이동_32톨_레지_멤_8 도착 자료 12))) ; MOV		EDI, [EBX+12]
	,(호출_이름표 '멤_복사) ; CALL	memcpy
))

(정의 생략 `(
	,(이름표 '생략) ; skip
	,@(32톨_접두사
      (주소_접두사
        (이동_32톨_레지_멤_8 쌓음 자료 12))) ; MOV		ESP, [EBX+12]
	,@(32톨_접두사
		(점프_원거리_32톨 (* 2 8) 0육0000001ㄴ)); JMP		DWORD 2*8:0x0000001b
))

(정의 키보드기다려 `(
	,(이름표 '키보드기다려) ; waitkbdout
	,@(입력_상수_하위8톨-셈 0육64) ; IN		AL, 0x64
	,@(비트곱_8톨_레지_상수 하위8톨-셈 0육02); AND		AL, 0x02
	,(뛰기_다름 '키보드기다려) ; JNZ		waitkbdout
	,@(돌아가기) ; RET
))

(정의 멤_복사_원본 `(
	,(이름표 '멤_복사) ; memcpy
	,@(이동_32톨_레지_멤_8 셈 ㅁ+출처 0) ; MOV		EAX, [ESI]
	,@(더하기_32톨_레지_상수 출처 4) ; ADD		ESI, 4
	,@(저장_32톨_멤_레지 ㅁ+도착 셈); MOV		[EDI], EAX
	,@(더하기_32톨_레지_상수 도착 4); ADD		EDI, 4
	,@(빼기_32톨_상수 횟수 1); SUB		ECX, 1
	,(뛰기_다름 '멤_복사) ; JNZ		memcpy
	,@(돌아가기) ; RET
))

(정의 멤_복사 `(
  ,@멤_복사_원본
  ,@(채워넣기 
      (나머지 
        (- 16 (나머지 (크기구하기 `(,@헤더 ,@화면320 ,@입력상태 ,@파이프라인_플러시 ,@생략 ,@키보드기다려 ,@멤_복사_원본)) 16)) 16) 0) ; ALIGNB 16
))

(정의 지디티0 `(
	,(이름표 '지디티0) ; GDT0
	,@(채워넣기 8 0); RESB	8
	,@(2바이트 0육ㅂㅂㅂㅂ) ,@(2바이트 0육0000) ,@(2바이트 0육9200) ,@(2바이트 0육00ㄷㅂ); DW		0xffff, 0x0000, 0x9200, 0x00cf
	,@(2바이트 0육ㅂㅂㅂㅂ) ,@(2바이트 0육0000) ,@(2바이트 0육9ㄱ28) ,@(2바이트 0육0047); DW		0xffff, 0x0000, 0x9a28, 0x0047

	,@(2바이트 0) ; DW		0
))

(정의 지디티알0_원본 `(
	,(이름표 '지디티알0) ; GDTR0
	,@(2바이트 (- (* 8 3) 1)) ; DW		8*3-1
	,(4톨_이름표_주소 '지디티0) ; DD		GDT0
))

(정의 지디티알0 `(
	,@지디티알0_원본
	,@(채워넣기 
      (나머지 
        (- 16 (나머지 (크기구하기 `(,@헤더 ,@화면320 ,@입력상태 ,@파이프라인_플러시 ,@생략 ,@키보드기다려 ,@멤_복사 ,@지디티0 ,@지디티알0_원본)) 16)) 16) 0) ; ALIGNB 16
))

(정의 최종_데이터 `(,@헤더 ,@화면320 ,@입력상태 ,@파이프라인_플러시 ,@생략 ,@키보드기다려 ,@멤_복사 ,@지디티0 ,@지디티알0))
(쓰기 최종_데이터)

(정의 이름표모음 (이름표수집 최종_데이터 시작점))

(쓰기 이름표모음)

(정의 최종 (이름표적용 이름표모음 최종_데이터 시작점))
(쓰기 최종)

; Program body
;(굽기 "./asmhead.bin" 최종)